#2. Пользователь вводит #время в секундах. #Переведите время в часы, #минуты и секунды и #выведите в формате #чч:мм:сс. Используйте #форматирование строк.

sec = int(input('Введите время в секундах: '))

sec = sec % (24 * 3600)
hour = sec // 3600 
sec = sec % 3600
min = sec // 60
sec = sec % 60

print(f"{hour}:{min}:{sec}")

