#Задание 1
#Поработайте с переменными, создайте #несколько, выведите на экран, запросите у #пользователя несколько чисел и строк и #сохраните в переменные, выведите на экран.

# Работа с переменными.
n = 12
k = 10
print(n, k)

name = input('Введите ваше имя: ')
city = input('Введите ваш город проживание: ')
num1 = int(input('Введите первое число: '))
num2 = int(input('Введите второе число: '))


# Вариант 1
print(f"Вас зовут {name}. Вы из города: {city}. Ваше первое число: {num1}. Ваше второе число: {num2}")

# Вариант 2
print('Вас зовут:',name)
print('Вы из города:',city)
print('Ваше первое число:',num1)
print('Ваше второе число:',num2)