# Реализовать программу, получающую на вход строку, состоящую из слов, разделенных пробелами и возвращающую длину каждого слова. Пример: "Солнце небо воздух земля" --> 6 4 6 5

# variant 1:
text = input()  # 'Солнце небо воздух земля'.split(' ')

map(len, text.split())
print(list(map(len, text.split())))

# variant 2:
print([len(x) for x in text.split()])
