# 2. Создайте программу для игры с конфетами человек против человека.
# Условие задачи: На столе лежит 2021 конфета. Играют два игрока делая ход друг после друга. Первый ход определяется жеребьёвкой. За один ход можно забрать не более чем 28 конфет. Все конфеты оппонента достаются сделавшему последний ход. Сколько конфет нужно взять первому игроку, чтобы забрать все конфеты у своего конкурента?

# a) Добавьте игру против бота

# b) Подумайте как наделить бота "интеллектом"

from random import randint
from random import randint, random


candies = 2021
while (candies > 0):
    print('Первый игрок берет конфеты, но не более 28 шт.!')
    user_1 = int(input())
    if user_1 > 28 or user_1 <= 0:
        print('Неверное кол-во конфет!')
        continue
    print()
    print('Второй игрок берет конфеты, но не более 28 шт.!')
    user_2 = int(input())
    while (user_2 > 28 or user_2 <= 0):
        input('Неверное кол-во конфет! Берите сколько обозначено! Не более не менее: ')
    print()
    candies -= user_1 + user_2
    print()
    if candies < 0 or user_1 > candies or user_2 > candies:
        break

print('Игра окончена! Осталось ', candies, ' конфет')

##############################

# игра с конфетами
# 2 игрока


candys = 2021
Name1 = input("Игрок №1, введите свое имя: ")
Name2 = input("Игрок №2, введите свое имя: ")
print('Идет жеребьевка:')
Name1_game = randint(1, 2)
if Name1_game == 1:
    gamer1 = Name1
    gamer2 = Name2
    print('Начинает игру - ', Name1)
else:
    gamer1 = Name2
    gamer2 = Name1
    print('Начинает игру - ', Name2)
print('Игра началась! На столе ', candys, 'конфет')
while candys > 0:
    if candys > 28:
        a1 = int(input(f"Ходит {gamer1}. Сколько вы берете конфет: "))
        if a1 > 28:
            a1 = int(
                input("Вы не можете взять больше 28 конфет. Сколько вы берете конфет? "))
            candys -= a1
            print('На столе осталось', candys, 'конфет')
        else:
            candys -= a1
            print('На столе осталось', candys, 'конфет')
    else:
        print(f"{gamer1} победил!")
        break
    if candys > 28:
        a2 = int(input(f"Ходит {gamer2}. Сколько вы берете конфет: "))
        if a2 > 28:
            a2 = int(
                input("Вы не можете взять больше 28 конфет. Сколько вы берете конфет? "))
            candys -= a2
            print('На столе осталось', candys, 'конфет')
        else:
            candys -= a2
            print('На столе осталось', candys, 'конфет')
    else:
        print(f"{gamer2} победил!")
        break
#####################

# игра с конфетами
# Игрок и бот


candys = 2021
print('Игра началась! На столе ', candys, 'конфет')
while candys > 0:
    if candys > 28:
        a1 = int(input("Ваш ход. Сколько вы берете конфет: "))
        if a1 > 28:
            a1 = int(
                input("Вы не можете взять больше 28 конфет. Сколько вы берете конфет? "))
            candys -= a1
            print('На столе осталось', candys, 'конфет')
        else:
            candys -= a1
            print('На столе осталось', candys, 'конфет')
    else:
        print("Вы победили!")
        break
    if candys > 28:
        a2 = randint(1, 28)
        print("Ход бота Сладкоежки. Бот Сладкоежка взял", a2, 'конфет')
        candys -= a2
        print('На столе осталось', candys, 'конфет')
    else:
        print("Бот Сладкоежка победил!")
        break

########################


# игра с конфетами
# Игрок и умный бот


candys = 2021
print('На столе ', candys, 'конфет')
while candys > 0:
    if candys > 28:
        a1 = int(input("Ваш ход. Сколько вы берете конфет: "))
        if a1 > 28:
            a1 = int(
                input("Вы не можете взять больше 28 конфет. Сколько вы берете конфет? "))
            candys -= a1
            print('На столе осталось', candys, 'конфет')
        else:
            candys -= a1
            print('На столе осталось', candys, 'конфет')
    else:
        print("Вы победили!")
        break
    if candys > 28:
        a2 = candys % 28 - 1
        if a2 <= 0:
            a2 = 1
        print("Ход бота Сладкоежки. Бот Сладкоежка взял", a2, 'конфет')
        candys -= a2
        print('На столе осталось', candys, 'конфет')
    else:
        print("Бот Сладкоежка победил!")
        break
